{
  "posts": [
    {
      "id": 1,
      "title": "Implementing Multiple Profiles for Dynamic Scaling of Neural NETWORK",
      "author": "abusaadah",
      "content": "\nI was trying to replicate the results in the paper titled \"Incomplete Dot Products for Dynamic Computation Scaling in Neural Network Inference\" using Tensorflow, but couldn't. After several emails to the authors, one of them had managed to reply and sent me the code, which was written in Chainer. All efforts to understand the code and convert it to Tensorflow or Keras proved abortive as I couldn't make sense out of many lines in the code. However, I managed to reproduce the first part of the results (Single Profile). My biggest challenge is how to implement the Multiple Profile. My research direction is heavily dependent on my ability to reproduce the results in the paper mentioned above. I will appreciate if you could help me because I have been in it for over five months and still couldn't figure out how to do it. Thank you.  fsfosjsfsofj oijiaofjisfisifosafjsafjiofjifiofiof",
      "comments": [
        {
          "postId": 1,
          "title": "asdfasdfasdfdsasdasdfdassd",
          "author": "a",
          "content": "asdfsda",
          "id": 1
        },
        {
          "postId": 1,
          "title": "a",
          "author": "aasdfsdaasdfsd",
          "content": "aasdfads",
          "id": 2
        },
        {
          "postId": 1,
          "title": "b",
          "author": "basdfdsasdfds",
          "content": "basdfdsasdfds",
          "id": 3
        },
        {
          "postId": 1,
          "title": "b",
          "author": "basdfdsafsdweqwerw",
          "content": "bqwerweqrqwerew",
          "id": 4
        },
        {
          "postId": 1,
          "title": "b",
          "author": "basfdsfdsafsd",
          "content": "basdfsd",
          "id": 5
        }
      ]
    },
    {
      "content": "Hello Everyone,\n\n \n\nI am doing my Final Year Project (FYP) and today I updated my Gradle version on Android Studio to 3.1.0 and I am not sure how to solve this error: \"Configuration 'compile' is obsolete and has been replaced with 'implementation'.\nIt will be removed at the end of 2018\". \n\n \n\nI also have this application where my application \"Keeps Stopping\" when I run it. OVER AND OVER!!! Could you please help me? Anyone?",
      "author": "SigmaDemon",
      "title": "Android Studio 3.1.0 - Configuration 'compile' is obsolete and has been replaced wit 'implementation",
      "id": 2
    },
  ],
  "comments": [
    {
      "postId": 1,
      "title": "asdfasdfasdfdsasdasdfdassd",
      "author": "a",
      "content": "asdfsda",
      "id": 1
    },
    {
      "postId": 1,
      "title": "a",
      "author": "aasdfsdaasdfsd",
      "content": "aasdfads",
      "id": 2
    },
    {
      "postId": 1,
      "title": "b",
      "author": "basdfdsasdfds",
      "content": "basdfdsasdfds",
      "id": 3
    },
    {
      "postId": 1,
      "title": "b",
      "author": "basdfdsafsdweqwerw",
      "content": "bqwerweqrqwerew",
      "id": 4
    },
    {
      "postId": 1,
      "title": "b",
      "author": "basfdsfdsafsd",
      "content": "basdfsd",
      "id": 5
    },
  ],
}